Revit 2027 API
RevitLinkGraphicsSettings.GetPhaseType Method
 The phase type of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkVisibility GetPhaseType()
Public Function GetPhaseType As LinkVisibility
public:
LinkVisibility GetPhaseType()
member GetPhaseType : unit -> LinkVisibility
Return Value
LinkVisibility
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace